#   "",
verb_pref = {
    "pref_1" : ["[Движение] Направленность к чему-либо, приближение, присоединение, добавление", ("под", "подо", "при", "до")],
    "pref_2" : ["[Движение] Доведение действия до какого-либо предела", ("до", "от")],
    "pref_3" : ["[Движение] Отдаление, удаление от чего-либо на небольшое расстояние", ("от",)],
    "pref_4" : ["[Движение] Полное удаление с какого-либо места", ("у",)],
    "pref_5" : ["[Движение] Направление внутрь чего-либо", ("в",)],
    "pref_6" : ["[Движение] Движение, удаление изнутри", ("вы",)],
    "pref_7" : ["[Движение] Направление действия на поверхность чего-либо", ("на",)],
    "pref_8" : ["[Движение] Движение с поверхности", ("с", "со")],
    "pref_9" : ["[Движение] Движение вокруг чего-либо", ("о", "об", "обо")],
    "pref_10" : ["[Движение] Последовательное пребывание в однотипных местах", ("о", "об", "обо")],
    "pref_11" : ["[Движение] Движение мимо чего-либо", ("про",)],
    "pref_12" : ["[Движение] Движение на определенном/некотором расстоянии", ("про",)],
    "pref_13" : ["[Движение] Движение из одного места в другое", ("пере",)],
    "pref_14" : ["[Движение] Попутное движение в место недолгого пребывания", ("за",)],
    "pref_15" : ["[Движение] Движение вглубь пространства", ("за",)],
    "pref_16" : ["[Движение] Движение за предмет", ("за",)],
    "pref_17" : ["[Движение] Движение вверх", ("вз", "вс")],
    "pref_18" : ["[Время] Начало действия", ("за", "по", "вз", "вс")],
    "pref_19" : ["[Время] Совершение действия в течение некоторого времени", ("по",)],
    "pref_20" : ["[Действие] Повторное действие", ("пере", "ре")],
    "pref_21" : ["[Действие] Противоположное действие", ("де",)],
    "pref_22" : ["[Интенсивность] Чрезмерная интенсивность", ("пере", "вз", "вс", "раз", "рас")],
    "pref_23" : ["[Интенсивность] Неполнота действия", ("недо")]
}

verb_suf = {
    "suf_1": ["[СУЩ] Со значением, свойственным сущ. Заниматься к-л деятельностью", ("ирова", "и", "нича", "ова", "ствова")],
    "suf_2": ["[СУЩ] С общим значением действия", ("а", "я")],
    "suf_3": ["[СУЩ] Превращать-ся в кого-то", ("е", "и", "ова")],
    "suf_4": ["[СУЩ] Действовать с помощью предмета", ("о", "и", "е")],
    "suf_5": ["[ПРИЛ] Наделять качеством, соответствующим слову", ("и",)],
    "suf_6": ["[ПРИЛ] Становиться кем-нибудь, каким-нибудь", ("а", "ну", "е", "ен", "нича")],
    "suf_7": ["[СУЩ] Значение действия/признака исходного слова", ("и", "изирова")],
    "suf_8": ["[МЕЖД] Звукоподражание", ("а", "ка")],
    "suf_9": ["[]", ()],
    "suf_10": ["[]", ()],
    "suf_11": ["[]", ()],
    "suf_12": ["[]", ()],
    "suf_13": ["[]", ()],
    "suf_14": ["[]", ()],
    "suf_15": ["[]", ()],
    "suf_16": ["[]", ()],
    "suf_17": ["[]", ()],
    "suf_18": ["[]", ()],
    "suf_19": ["[]", ()],
    "suf_20": ["[]", ()],
    "suf_21": ["[]", ()],
}

verb_pref_suf ={
    "pref_suf_": ""
}