#   "",
verb_prefixes = {
    "from_verb": ['под', 'подо', 'при', 'до', 'от', 'ото', 'у', 'в', 'вз', 'вы', 'на', 'с', 'со', 'о', 'об', 'обо', 'про',
                  'пере', 'за', 'де', 'ре', 'недо', 'из', 'раз']
                # , 'рас','ис', 'вс',
}

prefs = {"а", "ан", "анти", "без", "бес", "в", "во", "возо", "воз", "вос", "взо", "вз", "вс", "вы",
         "все", "вне", "взаимо", "до", "де", "диз", "дис", "за", "изо", "ино", "изпод", "любо", "между",
         "междо", "меж", "мимо", "на", "наи", "надо", "над", "не", "ни", "небезо", "небез", "небес", "недо",
         "низо", "низ", "нис", "обезо", "обез", "обес", "обо", "об", "о", "обще", "около", "ото", "от", "по",
         "па", "пере", "пре", "подо", "пода", "под", "поза", "после", "пра", "предо", "пред", "при", "про",
         "противо", "против", "разо", "раз", "разъ", "рас", "роз", "рос", "сверх", "с", "со", "съ", "среди",
         "су", "сыз", "тре", "у", "чрез", "через", "черес", "въ", "взъ", "изъ", "ана", "анти", "архи",
         "гипер", "гипо", "де", "дез", "дис", "ин", "интер", "инфра", "квази", "кило", "контр", "макро",
         "микро", "мега", "мата", "мульти", "орто", "пан", "пара", "пост", "прото", "ре","суб", "супер",
         "транс", "ультра", "зкстра", "экс"}
