#   '',
verb_prefixes = {
    'from_verb': ['под', 'подо', 'при', 'до', 'от', 'ото', 'у', 'в', 'вз', 'вы', 'на', 'с', 'со', 'о',
                  'об', 'обо', 'про', 'пере', 'за', 'де', 'ре', ('не', 'до'), 'из', 'раз', 'рас', 'ис', 'вс']
}
numr_prefixes = {

}

npro_prefixes = {
    'from_npro': ['ни', 'не', 'кое', 'кой']
}

prefs = {'а', 'ак', 'ан', 'анти', 'без', 'бес', 'в', 'во', 'возо', 'воз', 'вос', 'взо', 'вз', 'вс', 'вы',
         'все', 'вне', 'взаимо', 'до', 'де', 'диз', 'дис', 'за', 'изо', 'ино', 'изпод', 'любо', 'между',
         'междо', 'меж', 'мимо', 'на', 'наи', 'надо', 'над', 'не', 'ни', 'небезо', 'небез', 'небес', 'недо',
         'низо', 'низ', 'нис', 'обезо', 'обез', 'обес', 'обо', 'об', 'о', 'обще', 'около', 'ото', 'от', 'по',
         'па', 'пере', 'пре', 'подо', 'пода', 'под', 'поза', 'после', 'пра', 'предо', 'пред', 'при', 'про',
         'противо', 'против', 'разо', 'раз', 'рас', 'роз', 'рос', 'сверх', 'с', 'со', 'среди',
         'су', 'сыз', 'тре', 'у', 'чрез', 'через', 'черес',  'ана', 'анти', 'архи', 'поли', 'санти',
         'гипер', 'гипо', 'де', 'дез', 'дис', 'ин', 'интер', 'инфра', 'квази', 'кило', 'контр', 'макро',
         'микро', 'мега', 'мата', 'мульти', 'орто', 'пан', 'пара', 'пост', 'прото', 'ре','суб', 'супер',
         'транс', 'ультра', 'экс', 'аб', 'из', 'ыз', 'ба', 'ыс', 'экстра', 'вице', 'мета', 'нео', 'псевдо',
         'подъ', 'разъ', 'объ', 'съ', 'въ', 'взъ', 'изъ', 'безъ', 'отъ', 'межъ', 'надъ', 'панъ', 'постъ', 'предъ',
         'сверхъ', 'субъ', 'суперъ', 'трансъ', 'контръ', 'внутри',
         'им', 'ир',  #  не будет ли помечать суффиксы? TODO
         'кое', 'кой'}

complex_pref = {
    "за": "не",
    "по": ("не", "за"),
    "ис": "под",
    "не": ("без", "бес", "до"),
    "с": "ыз",
    "о": "без",
}
